
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 12 to change, 8 to destroy.</code></pre>

* Update
  * azapi_resource.add_local_user
  * azurerm_key_vault_secret.correspondence_topic_primary_shared_access_key
  * azurerm_key_vault_secret.evidence_share_topic_primary_shared_access_key
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_shared_access_key
  * azurerm_monitor_metric_alert.alerts[&#34;sscs-aat-dead-letter-alerts&#34;]
  * azurerm_monitor_metric_alert.alerts[&#34;sscs-aat-inflight-messages-alert&#34;]
  * module.metric-alert.azurerm_resource_group_template_deployment.metric-alert
  * module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Replace
  * module.correspondence-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.correspondence-topic.azurerm_servicebus_topic.servicebus_topic
  * module.correspondence-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule
  * module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.evidenceshare-topic.azurerm_servicebus_topic.servicebus_topic
  * module.evidenceshare-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.add_local_user will be updated in-place
  ~ resource "azapi_resource" "add_local_user" {
      ~ body                      = (sensitive value)
        id                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat/localUsers/sscsaat"
        name                      = (sensitive value)
      ~ output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.correspondence_topic_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "correspondence_topic_primary_shared_access_key" {
        id                      = "https://sscs-aat.vault.azure.net/secrets/correspondence-topic-shared-access-key/32388f249d9842458983fac228fad069"
        name                    = "correspondence-topic-shared-access-key"
        tags                    = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
            "source"              = "Service Bus sscs-correspondence-topic-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.evidence_share_topic_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "evidence_share_topic_primary_shared_access_key" {
        id                      = "https://sscs-aat.vault.azure.net/secrets/evidence-share-topic-shared-access-key/0877a0e2c42a46b188defa5ccdee10ba"
        name                    = "evidence-share-topic-shared-access-key"
        tags                    = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
            "source"              = "Service Bus sscs-evidenceshare-topic-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
        id                      = "https://sscs-aat.vault.azure.net/secrets/sscs-servicebus-connection-string-tf/95b324e2b7844fb69e76db45fbb030b6"
        name                    = "sscs-servicebus-connection-string-tf"
        tags                    = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
            "source"              = "Service Bus sscs-servicebus-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
        id                      = "https://sscs-aat.vault.azure.net/secrets/sscs-servicebus-shared-access-key/4f1baff06ad04a9f9ed0dfdff60abd33"
        name                    = "sscs-servicebus-shared-access-key"
        tags                    = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
            "source"              = "Service Bus sscs-servicebus-aat"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_monitor_metric_alert.alerts["sscs-aat-dead-letter-alerts"] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alerts" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/metricAlerts/sscs-aat-dead-letter-alerts"
        name                     = "sscs-aat-dead-letter-alerts"
      ~ scopes                   = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat",
        ] -> (known after apply)
        tags                     = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.alerts["sscs-aat-inflight-messages-alert"] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alerts" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/metricAlerts/sscs-aat-inflight-messages-alert"
        name                     = "sscs-aat-inflight-messages-alert"
      ~ scopes                   = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat",
        ] -> (known after apply)
        tags                     = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.correspondence-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "sscs-correspondence-topic-aat"
      + namespace_id                            = (known after apply)
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.correspondence-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-correspondence-topic-aat/subscriptions/sscs-correspondence-subscription-aat" -> (known after apply)
        name                                      = "sscs-correspondence-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-correspondence-topic-aat" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.correspondence-topic.data.azurerm_resource_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "sscs-aat"
      + tags       = (known after apply)
    }

  # module.correspondence-topic.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "sscs-servicebus-aat"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "sscs-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.correspondence-topic.azurerm_servicebus_topic.servicebus_topic must be replaced
-/+ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-correspondence-topic-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "sscs-correspondence-topic-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.correspondence-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-correspondence-topic-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
      ~ topic_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-correspondence-topic-aat" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.evidenceshare-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "sscs-evidenceshare-topic-aat"
      + namespace_id                            = (known after apply)
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat/subscriptions/sscs-evidenceshare-subscription-aat" -> (known after apply)
        name                                      = "sscs-evidenceshare-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.evidenceshare-topic.data.azurerm_resource_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "sscs-aat"
      + tags       = (known after apply)
    }

  # module.evidenceshare-topic.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "sscs-servicebus-aat"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "sscs-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
    }

  # module.evidenceshare-topic.azurerm_servicebus_topic.servicebus_topic must be replaced
-/+ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "sscs-evidenceshare-topic-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.evidenceshare-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
      ~ topic_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.metric-alert.data.template_file.actiongrouptemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "actiongrouptemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupsExternalId    = {
                      + type = "string"
                    }
                  + alertDescription          = {
                      + type = "string"
                    }
                  + alertEvaluationFrequency  = {
                      + type = "string"
                    }
                  + alertQuery                = {
                      + type = "string"
                    }
                  + alertSeverity             = {
                      + type = "string"
                    }
                  + alertWindowSize           = {
                      + type = "string"
                    }
                  + commonTags                = {
                      + type = "string"
                    }
                  + location                  = {
                      + type = "string"
                    }
                  + scheduledQueryRulesName   = {
                      + type = "string"
                    }
                  + storageAccountsExternalId = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2022-06-15"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('scheduledQueryRulesName')]"
                      + properties = {
                          + actions                = {
                              + actionGroups     = [
                                  + "[parameters('actionGroupsExternalId')]",
                                ]
                              + actionProperties = {}
                              + customProperties = {}
                            }
                          + autoMitigate           = false
                          + criteria               = {
                              + allOf = [
                                  + {
                                      + dimensions      = []
                                      + failingPeriods  = {
                                          + minFailingPeriodsToAlert  = 1
                                          + numberOfEvaluationPeriods = 1
                                        }
                                      + operator        = "GreaterThan"
                                      + query           = "[parameters('alertQuery')]"
                                      + threshold       = 0
                                      + timeAggregation = "Count"
                                    },
                                ]
                            }
                          + description            = "[parameters('alertDescription')]"
                          + displayName            = "[parameters('scheduledQueryRulesName')]"
                          + enabled                = true
                          + evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          + overrideQueryTimeRange = "P2D"
                          + scopes                 = [
                              + "[parameters('storageAccountsExternalId')]",
                            ]
                          + severity               = "[parameters('alertSeverity')]"
                          + targetResourceTypes    = [
                              + "Microsoft.Storage/storageAccounts",
                            ]
                          + windowSize             = "[parameters('alertWindowSize')]"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.metric-alert.azurerm_resource_group_template_deployment.metric-alert will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "metric-alert" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-fail-alert-sscssftp-email"
        name                     = "sscs-fail-alert-sscssftp-email"
      ~ output_content           = jsonencode({}) -> (known after apply)
        tags                     = {}
      ~ template_content         = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupsExternalId    = {
                      - type = "String"
                    }
                  - alertDescription          = {
                      - type = "String"
                    }
                  - alertEvaluationFrequency  = {
                      - type = "String"
                    }
                  - alertQuery                = {
                      - type = "String"
                    }
                  - alertSeverity             = {
                      - type = "String"
                    }
                  - alertWindowSize           = {
                      - type = "String"
                    }
                  - commonTags                = {
                      - type = "String"
                    }
                  - location                  = {
                      - type = "String"
                    }
                  - scheduledQueryRulesName   = {
                      - type = "String"
                    }
                  - storageAccountsExternalId = {
                      - type = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2022-06-15"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('scheduledQueryRulesName')]"
                      - properties = {
                          - actions                = {
                              - actionGroups     = [
                                  - "[parameters('actionGroupsExternalId')]",
                                ]
                              - actionProperties = {}
                              - customProperties = {}
                            }
                          - autoMitigate           = false
                          - criteria               = {
                              - allOf = [
                                  - {
                                      - dimensions      = []
                                      - failingPeriods  = {
                                          - minFailingPeriodsToAlert  = 1
                                          - numberOfEvaluationPeriods = 1
                                        }
                                      - operator        = "GreaterThan"
                                      - query           = "[parameters('alertQuery')]"
                                      - threshold       = 0
                                      - timeAggregation = "Count"
                                    },
                                ]
                            }
                          - description            = "[parameters('alertDescription')]"
                          - displayName            = "[parameters('scheduledQueryRulesName')]"
                          - enabled                = true
                          - evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          - overrideQueryTimeRange = "P2D"
                          - scopes                 = [
                              - "[parameters('storageAccountsExternalId')]",
                            ]
                          - severity               = "[parameters('alertSeverity')]"
                          - targetResourceTypes    = [
                              - "Microsoft.Storage/storageAccounts",
                            ]
                          - windowSize             = "[parameters('alertWindowSize')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace must be replaced
-/+ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      ~ capacity                            = 0 -> 1
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://sscs-servicebus-aat.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat" -> (known after apply)
        name                                = "sscs-servicebus-aat"
      ~ premium_messaging_partitions        = 0 3m-> 1 # forces replacement
      ~ sku                                 = "Standard" -> "Premium" # forces replacement
        tags                                = {
            "Team Contact"        = "#sscs"
            "Team Name"           = "SSCS Team"
            "application"         = "social-service-child-support"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
        }
        # (5 unchanged attributes hidden)

      ~ network_rule_set (known after apply)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ namespace_id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat" -> (known after apply) # forces replacement
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/SSCSF_alert"
        name                     = "SSCSF_alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/SSCSF_slack"
        name                     = "SSCSF_slack"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-fail-alert"
        name                     = "sscs-fail-alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-sya-submit-fail"
        name                     = "sscs-sya-submit-fail"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 8 to add, 12 to change, 8 to destroy.

Changes to Outputs:
  ~ evidence_share_topic_primary_shared_access_key = (sensitive value)
  ~ sb_primary_send_and_listen_connection_string   = (sensitive value)
  ~ sb_primary_send_and_listen_shared_access_key   = (sensitive value)
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":204,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->